* PROJ Better allocation
#+begin_src sh :results output :session nil :async
grep -rn "malloc\|realloc" src/
#+end_src

#+RESULTS:
: src/main.c:19:  char *mem = malloc(*size + 1);
: src/tagging.c:18:  char *atom_str = malloc(len + 1);
: src/tagging.c:33:  pair_t *pair = malloc(sizeof(*pair));
: src/tagging.c:40:  clos_t *clos = malloc(sizeof(*clos));
: src/tagging.c:113:    vec->items    = realloc(vec->items, sizeof(item) * vec->capacity);
: src/tagging.c:126:    vec->items    = realloc(vec->items, sizeof(*items) * vec->capacity);

Compare to:
#+begin_src sh :results output :session nil :async
grep -rn "free" src/
#+end_src

#+RESULTS:

We just allocate willy nilly really, without any oversight.  The only
instance which is somewhat acceptable is [[file:src/main.c::char *mem
= malloc(*size + 1);][src/main.c]] which is reading all source code in
one go.  Atoms are somewhat acceptable as ~make_atom~ is only called
when ~intern~ is called, which caches the memory itself.

So really, memory is only cleaned at program exit.  Unacceptable for a
dynamic interpreted language really.
